[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:8:61
     private _lastSymbol = ' ';
     private _toto: Board = new Board();
 
-    public Play(symbol: string, x: number, y: number): void {
-//if first move
-        if (this._lastSymbol == ' ') {
-            //if player is X
-            if (symbol == 'O') {
-                throw new Error('Invalid first player');
-            }
-        }
-//if not first move but player repeated
-        else if (symbol == this._lastSymbol) {
-            throw new Error('Invalid next player');
-        }
-//if not first move but play on an already played tile
-        else if (this._toto.TileAt(x, y).Symbol != ' ') {
-            throw new Error('Invalid position');
-        }
-
-// update game state
-        this._lastSymbol = symbol;
-        this._toto.AddTileAt(symbol, x, y);
-    }
+    public Play(symbol: string, x: number, y: number): void {}
 
     public Winner(): string {
killedBy: TicTacToe game should not allow player O to play first
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:10:13
 
     public Play(symbol: string, x: number, y: number): void {
 //if first move
-        if (this._lastSymbol == ' ') {
+        if (false) {
             //if player is X
             if (symbol == 'O') {
killedBy: TicTacToe game should not allow player O to play first
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:10:13
 
     public Play(symbol: string, x: number, y: number): void {
 //if first move
-        if (this._lastSymbol == ' ') {
+        if (true) {
             //if player is X
             if (symbol == 'O') {
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:12:17
 //if first move
         if (this._lastSymbol == ' ') {
             //if player is X
-            if (symbol == 'O') {
+            if (symbol != 'O') {
                 throw new Error('Invalid first player');
             }
killedBy: TicTacToe game should not allow player O to play first
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:12:17
 //if first move
         if (this._lastSymbol == ' ') {
             //if player is X
-            if (symbol == 'O') {
+            if (true) {
                 throw new Error('Invalid first player');
             }
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: Error: Invalid first player

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:17:46
             }
         }
 //if not first move but player repeated
-        else if (symbol == this._lastSymbol) {
-            throw new Error('Invalid next player');
-        }
+        else if (symbol == this._lastSymbol) {}
 //if not first move but play on an already played tile
         else if (this._toto.TileAt(x, y).Symbol != ' ') {
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:17:18
             }
         }
 //if not first move but player repeated
-        else if (symbol == this._lastSymbol) {
+        else if (symbol != this._lastSymbol) {
             throw new Error('Invalid next player');
         }
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:21:18
             throw new Error('Invalid next player');
         }
 //if not first move but play on an already played tile
-        else if (this._toto.TileAt(x, y).Symbol != ' ') {
+        else if (this._toto.TileAt(x, y).Symbol == ' ') {
             throw new Error('Invalid position');
         }
killedBy: TicTacToe game should not allow a player to play in last played position
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:21:18
             throw new Error('Invalid next player');
         }
 //if not first move but play on an already played tile
-        else if (this._toto.TileAt(x, y).Symbol != ' ') {
+        else if (true) {
             throw new Error('Invalid position');
         }
killedBy: TicTacToe game should not allow a player to play in any played position
statusReason: Error: Invalid position

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:33:13
     public Winner(): string {
 //if the positions in first row are taken
         if (
-            this._toto.TileAt(0, 0)!.Symbol != ' ' &&
+            this._toto.TileAt(0, 0)!.Symbol == ' ' &&
             this._toto.TileAt(0, 1)!.Symbol != ' ' &&
             this._toto.TileAt(0, 2)!.Symbol != ' '
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:33:13
     public Winner(): string {
 //if the positions in first row are taken
         if (
-            this._toto.TileAt(0, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 2)!.Symbol != ' '
+            false
         ) {
             //if first row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:34:13
 //if the positions in first row are taken
         if (
             this._toto.TileAt(0, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 1)!.Symbol != ' ' &&
+            this._toto.TileAt(0, 1)!.Symbol == ' ' &&
             this._toto.TileAt(0, 2)!.Symbol != ' '
         ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:34:13
 //if the positions in first row are taken
         if (
             this._toto.TileAt(0, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 1)!.Symbol != ' ' &&
+            true &&
             this._toto.TileAt(0, 2)!.Symbol != ' '
         ) {

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:35:13
         if (
             this._toto.TileAt(0, 0)!.Symbol != ' ' &&
             this._toto.TileAt(0, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 2)!.Symbol != ' '
+            this._toto.TileAt(0, 2)!.Symbol == ' '
         ) {
             //if first row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:35:13
         if (
             this._toto.TileAt(0, 0)!.Symbol != ' ' &&
             this._toto.TileAt(0, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(0, 2)!.Symbol != ' '
+            true
         ) {
             //if first row is full with same symbol

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:36:11
             this._toto.TileAt(0, 0)!.Symbol != ' ' &&
             this._toto.TileAt(0, 1)!.Symbol != ' ' &&
             this._toto.TileAt(0, 2)!.Symbol != ' '
-        ) {
-            //if first row is full with same symbol
-            if (
-                this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
-                this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(0, 0)!.Symbol;
-            }
-        }
+        ) {}
 
 //if the positions in 2nd row are taken
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:39:17
         ) {
             //if first row is full with same symbol
             if (
-                this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
-                this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
+                false
             ) {
                 return this._toto.TileAt(0, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:39:17
         ) {
             //if first row is full with same symbol
             if (
-                this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
+                this._toto.TileAt(0, 0)!.Symbol != this._toto.TileAt(0, 1)!.Symbol &&
                 this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
             ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:40:17
             //if first row is full with same symbol
             if (
                 this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
-                this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
+                this._toto.TileAt(0, 2)!.Symbol != this._toto.TileAt(0, 1)!.Symbol
             ) {
                 return this._toto.TileAt(0, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:40:17
             //if first row is full with same symbol
             if (
                 this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
-                this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
+                true
             ) {
                 return this._toto.TileAt(0, 0)!.Symbol;

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:41:15
             if (
                 this._toto.TileAt(0, 0)!.Symbol == this._toto.TileAt(0, 1)!.Symbol &&
                 this._toto.TileAt(0, 2)!.Symbol == this._toto.TileAt(0, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(0, 0)!.Symbol;
-            }
+            ) {}
         }
 
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:48:13
 
 //if the positions in 2nd row are taken
         if (
-            this._toto.TileAt(1, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 2)!.Symbol != ' '
+            true
         ) {
             //if middle row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:48:13
 
 //if the positions in 2nd row are taken
         if (
-            this._toto.TileAt(1, 0)!.Symbol != ' ' &&
+            this._toto.TileAt(1, 0)!.Symbol == ' ' &&
             this._toto.TileAt(1, 1)!.Symbol != ' ' &&
             this._toto.TileAt(1, 2)!.Symbol != ' '
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:49:13
 //if the positions in 2nd row are taken
         if (
             this._toto.TileAt(1, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 1)!.Symbol != ' ' &&
+            this._toto.TileAt(1, 1)!.Symbol == ' ' &&
             this._toto.TileAt(1, 2)!.Symbol != ' '
         ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:49:13
 //if the positions in 2nd row are taken
         if (
             this._toto.TileAt(1, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 1)!.Symbol != ' ' &&
+            true &&
             this._toto.TileAt(1, 2)!.Symbol != ' '
         ) {

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:50:13
         if (
             this._toto.TileAt(1, 0)!.Symbol != ' ' &&
             this._toto.TileAt(1, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 2)!.Symbol != ' '
+            this._toto.TileAt(1, 2)!.Symbol == ' '
         ) {
             //if middle row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:50:13
         if (
             this._toto.TileAt(1, 0)!.Symbol != ' ' &&
             this._toto.TileAt(1, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(1, 2)!.Symbol != ' '
+            true
         ) {
             //if middle row is full with same symbol

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:51:11
             this._toto.TileAt(1, 0)!.Symbol != ' ' &&
             this._toto.TileAt(1, 1)!.Symbol != ' ' &&
             this._toto.TileAt(1, 2)!.Symbol != ' '
-        ) {
-            //if middle row is full with same symbol
-            if (
-                this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
-                this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(1, 0)!.Symbol;
-            }
-        }
+        ) {}
 
 //if the positions in 2nd row are taken
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:54:17
         ) {
             //if middle row is full with same symbol
             if (
-                this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
-                this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
+                false
             ) {
                 return this._toto.TileAt(1, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:54:17
         ) {
             //if middle row is full with same symbol
             if (
-                this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
+                this._toto.TileAt(1, 0)!.Symbol != this._toto.TileAt(1, 1)!.Symbol &&
                 this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
             ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:55:17
             //if middle row is full with same symbol
             if (
                 this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
-                this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
+                this._toto.TileAt(1, 2)!.Symbol != this._toto.TileAt(1, 1)!.Symbol
             ) {
                 return this._toto.TileAt(1, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:55:17
             //if middle row is full with same symbol
             if (
                 this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
-                this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
+                true
             ) {
                 return this._toto.TileAt(1, 0)!.Symbol;

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:56:15
             if (
                 this._toto.TileAt(1, 0)!.Symbol == this._toto.TileAt(1, 1)!.Symbol &&
                 this._toto.TileAt(1, 2)!.Symbol == this._toto.TileAt(1, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(1, 0)!.Symbol;
-            }
+            ) {}
         }
 
killedBy: TicTacToe game should declare player X as winner if it plays three in middle row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:63:13
 
 //if the positions in 2nd row are taken
         if (
-            this._toto.TileAt(2, 0)!.Symbol != ' ' &&
+            this._toto.TileAt(2, 0)!.Symbol == ' ' &&
             this._toto.TileAt(2, 1)!.Symbol != ' ' &&
             this._toto.TileAt(2, 2)!.Symbol != ' '
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:63:13
 
 //if the positions in 2nd row are taken
         if (
-            this._toto.TileAt(2, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 2)!.Symbol != ' '
+            false
         ) {
             //if middle row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:64:13
 //if the positions in 2nd row are taken
         if (
             this._toto.TileAt(2, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 1)!.Symbol != ' ' &&
+            this._toto.TileAt(2, 1)!.Symbol == ' ' &&
             this._toto.TileAt(2, 2)!.Symbol != ' '
         ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:64:13
 //if the positions in 2nd row are taken
         if (
             this._toto.TileAt(2, 0)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 1)!.Symbol != ' ' &&
+            true &&
             this._toto.TileAt(2, 2)!.Symbol != ' '
         ) {

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:65:13
         if (
             this._toto.TileAt(2, 0)!.Symbol != ' ' &&
             this._toto.TileAt(2, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 2)!.Symbol != ' '
+            this._toto.TileAt(2, 2)!.Symbol == ' '
         ) {
             //if middle row is full with same symbol
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:65:13
         if (
             this._toto.TileAt(2, 0)!.Symbol != ' ' &&
             this._toto.TileAt(2, 1)!.Symbol != ' ' &&
-            this._toto.TileAt(2, 2)!.Symbol != ' '
+            true
         ) {
             //if middle row is full with same symbol

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:66:11
             this._toto.TileAt(2, 0)!.Symbol != ' ' &&
             this._toto.TileAt(2, 1)!.Symbol != ' ' &&
             this._toto.TileAt(2, 2)!.Symbol != ' '
-        ) {
-            //if middle row is full with same symbol
-            if (
-                this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
-                this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(2, 0)!.Symbol;
-            }
-        }
+        ) {}
 
         return ' ';
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:69:17
         ) {
             //if middle row is full with same symbol
             if (
-                this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
-                this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
+                false
             ) {
                 return this._toto.TileAt(2, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:69:17
         ) {
             //if middle row is full with same symbol
             if (
-                this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
+                this._toto.TileAt(2, 0)!.Symbol != this._toto.TileAt(2, 1)!.Symbol &&
                 this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
             ) {
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:70:17
             //if middle row is full with same symbol
             if (
                 this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
-                this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
+                this._toto.TileAt(2, 2)!.Symbol != this._toto.TileAt(2, 1)!.Symbol
             ) {
                 return this._toto.TileAt(2, 0)!.Symbol;
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Survived] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:70:17
             //if middle row is full with same symbol
             if (
                 this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
-                this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
+                true
             ) {
                 return this._toto.TileAt(2, 0)!.Symbol;

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:71:15
             if (
                 this._toto.TileAt(2, 0)!.Symbol == this._toto.TileAt(2, 1)!.Symbol &&
                 this._toto.TileAt(2, 2)!.Symbol == this._toto.TileAt(2, 1)!.Symbol
-            ) {
-                return this._toto.TileAt(2, 0)!.Symbol;
-            }
+            ) {}
         }
 
killedBy: TicTacToe game should declare player X as winner if it plays three in bottom row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:89:19
 class Board {
     private _plays: Tile[] = [];
 
-    constructor() {
-        for (let i = 0; i < 3; i++) {
-            for (let j = 0; j < 3; j++) {
-                const tile: Tile = {X: i, Y: j, Symbol: ' '};
-                this._plays.push(tile);
-            }
-        }
-    }
+    constructor() {}
 
     public TileAt(x: number, y: number): Tile {
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: TypeError: Cannot set properties of undefined (setting 'Symbol')

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:90:37
     private _plays: Tile[] = [];
 
     constructor() {
-        for (let i = 0; i < 3; i++) {
-            for (let j = 0; j < 3; j++) {
-                const tile: Tile = {X: i, Y: j, Symbol: ' '};
-                this._plays.push(tile);
-            }
-        }
+        for (let i = 0; i < 3; i++) {}
     }
 
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: TypeError: Cannot set properties of undefined (setting 'Symbol')

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:90:25
     private _plays: Tile[] = [];
 
     constructor() {
-        for (let i = 0; i < 3; i++) {
+        for (let i = 0; false; i++) {
             for (let j = 0; j < 3; j++) {
                 const tile: Tile = {X: i, Y: j, Symbol: ' '};
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: TypeError: Cannot set properties of undefined (setting 'Symbol')

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:91:41
 
     constructor() {
         for (let i = 0; i < 3; i++) {
-            for (let j = 0; j < 3; j++) {
-                const tile: Tile = {X: i, Y: j, Symbol: ' '};
-                this._plays.push(tile);
-            }
+            for (let j = 0; j < 3; j++) {}
         }
     }
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: TypeError: Cannot set properties of undefined (setting 'Symbol')

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:91:29
 
     constructor() {
         for (let i = 0; i < 3; i++) {
-            for (let j = 0; j < 3; j++) {
+            for (let j = 0; j >= 3; j++) {
                 const tile: Tile = {X: i, Y: j, Symbol: ' '};
                 this._plays.push(tile);
killedBy: TicTacToe game should not allow player x to play twice in a row
statusReason: TypeError: Cannot set properties of undefined (setting 'Symbol')

[Killed] StringLiteral
src/12_RefactoringGolf/exo1/kata.ts:92:57
     constructor() {
         for (let i = 0; i < 3; i++) {
             for (let j = 0; j < 3; j++) {
-                const tile: Tile = {X: i, Y: j, Symbol: ' '};
+                const tile: Tile = {X: i, Y: j, Symbol: ""};
                 this._plays.push(tile);
             }
killedBy: TicTacToe game should not allow a player to play in any played position
statusReason: Error: Invalid position

[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:99:58
     }
 
     public TileAt(x: number, y: number): Tile {
-        return this._plays.find((t: Tile) => t.X == x && t.Y == y)!;
+        return this._plays.find((t: Tile) => t.X == x && t.Y != y)!;
     }
 
killedBy: TicTacToe game should not allow a player to play in last played position
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/12_RefactoringGolf/exo1/kata.ts:99:46
     }
 
     public TileAt(x: number, y: number): Tile {
-        return this._plays.find((t: Tile) => t.X == x && t.Y == y)!;
+        return this._plays.find((t: Tile) => true)!;
     }
 
killedBy: TicTacToe game should not allow a player to play in any played position
statusReason: Error: Invalid position

[Killed] BlockStatement
src/12_RefactoringGolf/exo1/kata.ts:102:66
         return this._plays.find((t: Tile) => t.X == x && t.Y == y)!;
     }
 
-    public AddTileAt(symbol: string, x: number, y: number): void {
-//@ts-ignore
-        const tile: Tile = {X: x, Y: y, Symbol: symbol};
-
-        this._plays.find((t: Tile) => t.X == x && t.Y == y)!.Symbol = symbol;
-    }
+    public AddTileAt(symbol: string, x: number, y: number): void {}
 }
 
killedBy: TicTacToe game should not allow a player to play in last played position
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] LogicalOperator
src/12_RefactoringGolf/exo1/kata.ts:106:39
 //@ts-ignore
         const tile: Tile = {X: x, Y: y, Symbol: symbol};
 
-        this._plays.find((t: Tile) => t.X == x && t.Y == y)!.Symbol = symbol;
+        this._plays.find((t: Tile) => t.X == x || t.Y == y)!.Symbol = symbol;
     }
 }
killedBy: TicTacToe game should declare player X as winner if it plays three in top row
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: " "
