[Killed] EqualityOperator
src/12_RefactoringGolf/exo1/kata.ts:106:39
 //@ts-ignore
         const tile: Tile = {X: x, Y: y, Symbol: symbol};
 
-        this._plays.find((t: Tile) => t.X == x && t.Y == y)!.Symbol = symbol;
+        this._plays.find((t: Tile) => t.X != x && t.Y == y)!.Symbol = symbol;
     }
 }
killedBy: TicTacToe game should not allow a player to play in last played position
statusReason: Error: expect(received).toThrow()

Received function did not throw
